apache/nuttx/arch/mips/src/pic32mz/hardware/pic32mz-ethernet.h
/****************************************************************************************************
 * arch/mips/src/pic32mz/hardware/pic32mz-ethernet.h
 *
 *   Copyright (C) 2015 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************************************/

#ifndef __ARCH_MIPS_SRC_PIC32MZ_HARDWARE_PIC32MZ_ETHERNET_H
#define __ARCH_MIPS_SRC_PIC32MZ_HARDWARE_PIC32MZ_ETHERNET_H

/****************************************************************************************************
 * Included Files
 ****************************************************************************************************/

#include <nuttx/config.h>
#include <arch/pic32mz/chip.h>

#include "hardware/pic32mz-memorymap.h"

#if CHIP_NETHERNET > 0

/****************************************************************************************************
 * Pre-processor Definitions
 ****************************************************************************************************/
/* Register Offsets *********************************************************************************/

/* Controller and DMA Engine Configuration/Status Registers */

#define PIC32MZ_ETH_CON1_OFFSET        0x0000  /* Ethernet Controller Control 1 Register */
#define PIC32MZ_ETH_CON1CLR_OFFSET     0x0004
#define PIC32MZ_ETH_CON1SET_OFFSET     0x0008
#define PIC32MZ_ETH_CON1INV_OFFSET     0x000c

#define PIC32MZ_ETH_CON2_OFFSET        0x0010  /* Ethernet Controller Control 2 Register */
#define PIC32MZ_ETH_CON2CLR_OFFSET     0x0014
#define PIC32MZ_ETH_CON2SET_OFFSET     0x0018
#define PIC32MZ_ETH_CON2INV_OFFSET     0x001c

#define PIC32MZ_ETH_TXST_OFFSET        0x0020  /* Ethernet Controller TX Packet Descriptor Start Address Register */
#define PIC32MZ_ETH_TXSTCLR_OFFSET     0x0024
#define PIC32MZ_ETH_TXSTSET_OFFSET     0x0028
#define PIC32MZ_ETH_TXSTINV_OFFSET     0x002c

#define PIC32MZ_ETH_RXST_OFFSET        0x0030  /* Ethernet Controller RX Packet Descriptor Start Address Register */
#define PIC32MZ_ETH_RXSTCLR_OFFSET     0x0034
#define PIC32MZ_ETH_RXSTSET_OFFSET     0x0038
#define PIC32MZ_ETH_RXSTINV_OFFSET     0x003c

#define PIC32MZ_ETH_IEN_OFFSET         0x00c0  /* Ethernet Controller Interrupt Enable Register */
#define PIC32MZ_ETH_IENCLR_OFFSET      0x00c4
#define PIC32MZ_ETH_IENSET_OFFSET      0x00c8
#define PIC32MZ_ETH_IENINV_OFFSET      0x00cc

#define PIC32MZ_ETH_IRQ_OFFSET         0x00d0  /* Ethernet Controller Interrupt Request Register */
#define PIC32MZ_ETH_IRQCLR_OFFSET      0x00d4
#define PIC32MZ_ETH_IRQSET_OFFSET      0x00d8
#define PIC32MZ_ETH_IRQINV_OFFSET      0x00dc

#define PIC32MZ_ETH_STAT_OFFSET        0x00e0  /* Ethernet Controller Status Register */

/* RX Filtering Configuration Registers */

#define PIC32MZ_ETH_RXFC_OFFSET        0x00a0  /* Ethernet Controller Receive Filter Configuration Register */
#define PIC32MZ_ETH_RXFCCLR_OFFSET     0x00a4
#define PIC32MZ_ETH_RXFCSET_OFFSET     0x00a8
#define PIC32MZ_ETH_RXFCINV_OFFSET     0x00ac

#define PIC32MZ_ETH_HT0_OFFSET         0x0040  /* Ethernet Controller Hash Table 0 Register */
#define PIC32MZ_ETH_HT0CLR_OFFSET      0x0044
#define PIC32MZ_ETH_HT0SET_OFFSET      0x0048
#define PIC32MZ_ETH_HT0INV_OFFSET      0x004c

#define PIC32MZ_ETH_HT1_OFFSET         0x0050  /* Ethernet Controller Hash Table 1 Register */
#define PIC32MZ_ETH_HT1CLR_OFFSET      0x0054
#define PIC32MZ_ETH_HT1SET_OFFSET      0x0058
#define PIC32MZ_ETH_HT1INV_OFFSET      0x005c

#define PIC32MZ_ETH_PMM0_OFFSET        0x0060  /* Ethernet Controller Pattern Match Mask 0 Register */
#define PIC32MZ_ETH_PMM0CLR_OFFSET     0x0064
#define PIC32MZ_ETH_PMM0SET_OFFSET     0x0068
#define PIC32MZ_ETH_PMM0INV_OFFSET     0x006c

#define PIC32MZ_ETH_PMM1_OFFSET        0x0070  /* Ethernet Controller Pattern Match Mask 1 Register */
#define PIC32MZ_ETH_PMM1CLR_OFFSET     0x0074
#define PIC32MZ_ETH_PMM1SET_OFFSET     0x0078
#define PIC32MZ_ETH_PMM1INV_OFFSET     0x007c

#define PIC32MZ_ETH_PMCS_OFFSET        0x0080  /* Ethernet Controller Pattern Match Checksum Register */
#define PIC32MZ_ETH_PMCSCLR_OFFSET     0x0084
#define PIC32MZ_ETH_PMCSSET_OFFSET     0x0088
#define PIC32MZ_ETH_PMCSINV_OFFSET     0x008c

#define PIC32MZ_ETH_PMO_OFFSET         0x0090  /* Ethernet Controller Pattern Match Offset Register */
#define PIC32MZ_ETH_PMOCLR_OFFSET      0x0094
#define PIC32MZ_ETH_PMOSET_OFFSET      0x0098
#define PIC32MZ_ETH_PMOINV_OFFSET      0x009c

/* Flow Control Configuring Register */

