apache/nuttx/arch/mips/src/pic32mz/hardware/pic32mz-ethernet.h
#define PIC32MZ_ETH_RXWM_OFFSET        0x00b0  /* Ethernet Controller Receive Watermarks Register */
#define PIC32MZ_ETH_RXWMCLR_OFFSET     0x00b4
#define PIC32MZ_ETH_RXWMSET_OFFSET     0x00b8
#define PIC32MZ_ETH_RXWMINV_OFFSET     0x00bc

/* Ethernet Statistics Registers */

#define PIC32MZ_ETH_RXOVFLOW_OFFSET    0x0100  /* Ethernet Controller Receive Overflow Statistics Register */
#define PIC32MZ_ETH_RXOVFLOWCLR_OFFSET 0x0104
#define PIC32MZ_ETH_RXOVFLOWSET_OFFSET 0x0108
#define PIC32MZ_ETH_RXOVFLOWINV_OFFSET 0x010c

#define PIC32MZ_ETH_FRMTXOK_OFFSET     0x0110  /* Ethernet Controller Frames Transmitted OK Statistics Register */
#define PIC32MZ_ETH_FRMTXOKCLR_OFFSET  0x0114
#define PIC32MZ_ETH_FRMTXOKSET_OFFSET  0x0118
#define PIC32MZ_ETH_FRMTXOKINV_OFFSET  0x011c

#define PIC32MZ_ETH_SCOLFRM_OFFSET     0x0120  /* Ethernet Controller Single Collision Frames Statistics Register */
#define PIC32MZ_ETH_SCOLFRMCLR_OFFSET  0x0124
#define PIC32MZ_ETH_SCOLFRMSET_OFFSET  0x0128
#define PIC32MZ_ETH_SCOLFRMINV_OFFSET  0x012c

#define PIC32MZ_ETH_MCOLFRM_OFFSET     0x0130  /* Ethernet Controller Multiple Collision Frames Statistics Register */
#define PIC32MZ_ETH_MCOLFRMCLR_OFFSET  0x0134
#define PIC32MZ_ETH_MCOLFRMSET_OFFSET  0x0138
#define PIC32MZ_ETH_MCOLFRMINV_OFFSET  0x013c

#define PIC32MZ_ETH_FRMRXOK_OFFSET     0x0140  /* Ethernet Controller Frames Received OK Statistics Register */
#define PIC32MZ_ETH_FRMRXOKCLR_OFFSET  0x0144
#define PIC32MZ_ETH_FRMRXOKSET_OFFSET  0x0148
#define PIC32MZ_ETH_FRMRXOKINV_OFFSET  0x014c

#define PIC32MZ_ETH_FCSERR_OFFSET      0x0150  /* Ethernet Controller Frame Check Sequence Error Statistics Register */
#define PIC32MZ_ETH_FCSERRCLR_OFFSET   0x0154
#define PIC32MZ_ETH_FCSERRSET_OFFSET   0x0158
#define PIC32MZ_ETH_FCSERRINV_OFFSET   0x015c

#define PIC32MZ_ETH_ALGNERR_OFFSET     0x0160  /* Ethernet Controller Alignment Errors Statistics Register */
#define PIC32MZ_ETH_ALGNERRCLR_OFFSET  0x0164
#define PIC32MZ_ETH_ALGNERRSET_OFFSET  0x0168
#define PIC32MZ_ETH_ALGNERRINV_OFFSET  0x016c

/* MAC Configuration Registers */

#define PIC32MZ_EMAC1_CFG1_OFFSET      0x0200  /* Ethernet Controller MAC Configuration 1 Register */
#define PIC32MZ_EMAC1_CFG1CLR_OFFSET   0x0204
#define PIC32MZ_EMAC1_CFG1SET_OFFSET   0x0208
#define PIC32MZ_EMAC1_CFG1INV_OFFSET   0x020c

#define PIC32MZ_EMAC1_CFG2_OFFSET      0x0210  /* Ethernet Controller MAC Configuration 2 Register */
#define PIC32MZ_EMAC1_CFG2CLR_OFFSET   0x0214
#define PIC32MZ_EMAC1_CFG2SET_OFFSET   0x0218
#define PIC32MZ_EMAC1_CFG2INV_OFFSET   0x021c

#define PIC32MZ_EMAC1_IPGT_OFFSET      0x0220  /* Ethernet Controller MAC Back-to-Back Interpacket Gap Register */
#define PIC32MZ_EMAC1_IPGTCLR_OFFSET   0x0224
#define PIC32MZ_EMAC1_IPGTSET_OFFSET   0x0228
#define PIC32MZ_EMAC1_IPGTINV_OFFSET   0x022c

#define PIC32MZ_EMAC1_IPGR_OFFSET      0x0230  /* Ethernet Controller MAC Non-Back-to-Back Interpacket Gap Register */
#define PIC32MZ_EMAC1_IPGRCLR_OFFSET   0x0234
#define PIC32MZ_EMAC1_IPGRSET_OFFSET   0x0238
#define PIC32MZ_EMAC1_IPGRINV_OFFSET   0x023c

#define PIC32MZ_EMAC1_CLRT_OFFSET      0x0240  /* Ethernet Controller MAC Collision Window/Retry Limit Register */
#define PIC32MZ_EMAC1_CLRTCLR_OFFSET   0x0244
#define PIC32MZ_EMAC1_CLRTSET_OFFSET   0x0248
#define PIC32MZ_EMAC1_CLRTINV_OFFSET   0x024c

#define PIC32MZ_EMAC1_MAXF_OFFSET      0x0250  /* Ethernet Controller MAC Maximum Frame Length Register */
#define PIC32MZ_EMAC1_MAXFCLR_OFFSET   0x0254
#define PIC32MZ_EMAC1_MAXFSET_OFFSET   0x0258
#define PIC32MZ_EMAC1_MAXFINV_OFFSET   0x025c

#define PIC32MZ_EMAC1_SUPP_OFFSET      0x0260  /* Ethernet Controller MAC PHY Support Register */
#define PIC32MZ_EMAC1_SUPPCLR_OFFSET   0x0264
#define PIC32MZ_EMAC1_SUPPSET_OFFSET   0x0268
#define PIC32MZ_EMAC1_SUPPINV_OFFSET   0x026c

#define PIC32MZ_EMAC1_TEST_OFFSET      0x0270  /* Ethernet Controller MAC Test Register */
#define PIC32MZ_EMAC1_TESTCLR_OFFSET   0x0274
#define PIC32MZ_EMAC1_TESTSET_OFFSET   0x0278
#define PIC32MZ_EMAC1_TESTINV_OFFSET   0x027c

#define PIC32MZ_EMAC1_SA0_OFFSET       0x0300  /* Ethernet Controller MAC Station Address 0 Register */
#define PIC32MZ_EMAC1_SA0CLR_OFFSET    0x0304
#define PIC32MZ_EMAC1_SA0SET_OFFSET    0x0308
#define PIC32MZ_EMAC1_SA0INV_OFFSET    0x030c

#define PIC32MZ_EMAC1_SA1_OFFSET       0x0310  /* Ethernet Controller MAC Station Address 1 Register */
#define PIC32MZ_EMAC1_SA1CLR_OFFSET    0x0314
#define PIC32MZ_EMAC1_SA1SET_OFFSET    0x0318
#define PIC32MZ_EMAC1_SA1INV_OFFSET    0x031c

#define PIC32MZ_EMAC1_SA2_OFFSET       0x0320  /* Ethernet Controller MAC Station Address 2 Register */
#define PIC32MZ_EMAC1_SA2CLR_OFFSET    0x0324
#define PIC32MZ_EMAC1_SA2SET_OFFSET    0x0328
#define PIC32MZ_EMAC1_SA2INV_OFFSET    0x032c

/* MII Management Registers */

#define PIC32MZ_EMAC1_MCFG_OFFSET      0x0280  /* Ethernet Controller MAC MII Management Configuration Register */
#define PIC32MZ_EMAC1_MCFGCLR_OFFSET   0x0284
#define PIC32MZ_EMAC1_MCFGSET_OFFSET   0x0288
#define PIC32MZ_EMAC1_MCFGINV_OFFSET   0x028c

#define PIC32MZ_EMAC1_MCMD_OFFSET      0x0290  /* Ethernet Controller MAC MII Management Command Register */
#define PIC32MZ_EMAC1_MCMDCLR_OFFSET   0x0294
#define PIC32MZ_EMAC1_MCMDSET_OFFSET   0x0298
#define PIC32MZ_EMAC1_MCMDINV_OFFSET   0x029c

#define PIC32MZ_EMAC1_MADR_OFFSET      0x02a0  /* Ethernet Controller MAC MII Management Address Register */
#define PIC32MZ_EMAC1_MADRCLR_OFFSET   0x02a4
#define PIC32MZ_EMAC1_MADRSET_OFFSET   0x02a8
#define PIC32MZ_EMAC1_MADRINV_OFFSET   0x02ac

#define PIC32MZ_EMAC1_MWTD_OFFSET      0x02b0  /* Ethernet Controller MAC MII Management Write Data Register */
#define PIC32MZ_EMAC1_MWTDCLR_OFFSET   0x02b4
#define PIC32MZ_EMAC1_MWTDSET_OFFSET   0x02b8
#define PIC32MZ_EMAC1_MWTDINV_OFFSET   0x02bc

#define PIC32MZ_EMAC1_MRDD_OFFSET      0x02c0  /* Ethernet Controller MAC MII Management Read Data Register */
#define PIC32MZ_EMAC1_MRDDCLR_OFFSET   0x02c4
#define PIC32MZ_EMAC1_MRDDSET_OFFSET   0x02c8
#define PIC32MZ_EMAC1_MRDDINV_OFFSET   0x02cc

