apache/nuttx/arch/mips/src/pic32mz/hardware/pic32mz-ethernet.h
#define PIC32MZ_EMAC1_MIND_OFFSET      0x02d0  /* Ethernet Controller MAC MII Management Indicators Register */
#define PIC32MZ_EMAC1_MINDCLR_OFFSET   0x02d4
#define PIC32MZ_EMAC1_MINDSET_OFFSET   0x02d8
#define PIC32MZ_EMAC1_MINDINV_OFFSET   0x02dc

/* Register Addresses *******************************************************************************/

/* Controller and DMA Engine Configuration/Status Registers */

#define PIC32MZ_ETH_CON1               (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_CON1_OFFSET)
#define PIC32MZ_ETH_CON1CLR            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_CON1CLR_OFFSET)
#define PIC32MZ_ETH_CON1SET            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_CON1SET_OFFSET)
#define PIC32MZ_ETH_CON1INV            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_CON1INV_OFFSET)

#define PIC32MZ_ETH_CON2               (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_CON2_OFFSET)
#define PIC32MZ_ETH_CON2CLR            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_CON2CLR_OFFSET)
#define PIC32MZ_ETH_CON2SET            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_CON2SET_OFFSET)
#define PIC32MZ_ETH_CON2INV            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_CON2INV_OFFSET)

#define PIC32MZ_ETH_TXST               (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_TXST_OFFSET)
#define PIC32MZ_ETH_TXSTCLR            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_TXSTCLR_OFFSET)
#define PIC32MZ_ETH_TXSTSET            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_TXSTSET_OFFSET)
#define PIC32MZ_ETH_TXSTINV            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_TXSTINV_OFFSET)

#define PIC32MZ_ETH_RXST               (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_RXST_OFFSET)
#define PIC32MZ_ETH_RXSTCLR            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_RXSTCLR_OFFSET)
#define PIC32MZ_ETH_RXSTSET            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_RXSTSET_OFFSET)
#define PIC32MZ_ETH_RXSTINV            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_RXSTINV_OFFSET)

#define PIC32MZ_ETH_IEN                (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_IEN_OFFSET)
#define PIC32MZ_ETH_IENCLR             (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_IENCLR_OFFSET)
#define PIC32MZ_ETH_IENSET             (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_IENSET_OFFSET)
#define PIC32MZ_ETH_IENINV             (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_IENINV_OFFSET)

#define PIC32MZ_ETH_IRQ                (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_IRQ_OFFSET)
#define PIC32MZ_ETH_IRQCLR             (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_IRQCLR_OFFSET)
#define PIC32MZ_ETH_IRQSET             (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_IRQSET_OFFSET)
#define PIC32MZ_ETH_IRQINV             (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_IRQINV_OFFSET)

#define PIC32MZ_ETH_STAT               (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_STAT_OFFSET)

/* RX Filtering Configuration Registers */

#define PIC32MZ_ETH_RXFC               (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_RXFC_OFFSET)
#define PIC32MZ_ETH_RXFCCLR            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_RXFCCLR_OFFSET)
#define PIC32MZ_ETH_RXFCSET            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_RXFCSET_OFFSET)
#define PIC32MZ_ETH_RXFCINV            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_RXFCINV_OFFSET)

#define PIC32MZ_ETH_HT0                (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_HT0_OFFSET)
#define PIC32MZ_ETH_HT0CLR             (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_HT0CLR_OFFSET)
#define PIC32MZ_ETH_HT0SET             (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_HT0SET_OFFSET)
#define PIC32MZ_ETH_HT0INV             (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_HT0INV_OFFSET)

#define PIC32MZ_ETH_HT1                (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_HT1_OFFSET)
#define PIC32MZ_ETH_HT1CLR             (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_HT1CLR_OFFSET)
#define PIC32MZ_ETH_HT1SET             (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_HT1SET_OFFSET)
#define PIC32MZ_ETH_HT1INV             (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_HT1INV_OFFSET)

#define PIC32MZ_ETH_PMM0               (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_PMM0_OFFSET)
#define PIC32MZ_ETH_PMM0CLR            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_PMM0CLR_OFFSET)
#define PIC32MZ_ETH_PMM0SET            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_PMM0SET_OFFSET)
#define PIC32MZ_ETH_PMM0INV            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_PMM0INV_OFFSET)

#define PIC32MZ_ETH_PMM1               (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_PMM1_OFFSET)
#define PIC32MZ_ETH_PMM1CLR            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_PMM1CLR_OFFSET)
#define PIC32MZ_ETH_PMM1SET            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_PMM1SET_OFFSET)
#define PIC32MZ_ETH_PMM1INV            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_PMM1INV_OFFSET)

#define PIC32MZ_ETH_PMCS               (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_PMCS_OFFSET)
#define PIC32MZ_ETH_PMCSCLR            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_PMCSCLR_OFFSET)
#define PIC32MZ_ETH_PMCSSET            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_PMCSSET_OFFSET)
#define PIC32MZ_ETH_PMCSINV            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_PMCSINV_OFFSET)

#define PIC32MZ_ETH_PMO                (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_PMO_OFFSET)
#define PIC32MZ_ETH_PMOCLR             (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_PMOCLR_OFFSET)
#define PIC32MZ_ETH_PMOSET             (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_PMOSET_OFFSET)
#define PIC32MZ_ETH_PMOINV             (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_PMOINV_OFFSET)

/* Flow Control Configuring Register */

#define PIC32MZ_ETH_RXWM               (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_RXWM_OFFSET)
#define PIC32MZ_ETH_RXWMCLR            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_RXWMCLR_OFFSET)
#define PIC32MZ_ETH_RXWMSET            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_RXWMSET_OFFSET)
#define PIC32MZ_ETH_RXWMINV            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_RXWMINV_OFFSET)

/* Ethernet Statistics Registers */

#define PIC32MZ_ETH_RXOVFLOW           (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_RXOVFLOW_OFFSET)
#define PIC32MZ_ETH_RXOVFLOWCLR        (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_RXOVFLOWCLR_OFFSET)
#define PIC32MZ_ETH_RXOVFLOWSET        (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_RXOVFLOWSET_OFFSET)
#define PIC32MZ_ETH_RXOVFLOWINV        (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_RXOVFLOWINV_OFFSET)

#define PIC32MZ_ETH_FRMTXOK            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_FRMTXOK_OFFSET)
#define PIC32MZ_ETH_FRMTXOKCLR         (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_FRMTXOKCLR_OFFSET)
#define PIC32MZ_ETH_FRMTXOKSET         (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_FRMTXOKSET_OFFSET)
#define PIC32MZ_ETH_FRMTXOKINV         (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_FRMTXOKINV_OFFSET)

#define PIC32MZ_ETH_SCOLFRM            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_SCOLFRM_OFFSET)
#define PIC32MZ_ETH_SCOLFRMCLR         (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_SCOLFRMCLR_OFFSET)
#define PIC32MZ_ETH_SCOLFRMSET         (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_SCOLFRMSET_OFFSET)
#define PIC32MZ_ETH_SCOLFRMINV         (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_SCOLFRMINV_OFFSET)

#define PIC32MZ_ETH_MCOLFRM            (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_MCOLFRM_OFFSET)
#define PIC32MZ_ETH_MCOLFRMCLR         (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_MCOLFRMCLR_OFFSET)
#define PIC32MZ_ETH_MCOLFRMSET         (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_MCOLFRMSET_OFFSET)
#define PIC32MZ_ETH_MCOLFRMINV         (PIC32MZ_ETH_K1BASE+PIC32MZ_ETH_MCOLFRMINV_OFFSET)

